[{"title":"Por donde empezar?","html":"<figure class=\"kg-card kg-image-card\"><img src=\"https://guillermocv.herokuapp.com/content/images/2021/03/Asset-5-1.png\" class=\"kg-image\" alt=\"Imagen Desarrollo Front End\"></figure><p>Bueno, uno podría decir .. porqué no me hice esa pregunta hace un año cuando empecé a estudiar, o … porqué no le pregunté a alguien que me guiara. Y si, podría pensar uno que me hubiera podido ahorrar mucho tiempo, pero la verdad es que es un camino necesario que hay que recorrer.</p><p>Siendo un “UI/UX designer”( la verdad es que no he diseñado nunca una interfaz digital o una experiencia de usuario a nivel profesional, solo a nivel de proyectos personales), me pareció más correcto irme la rama del Frontend en desarrollo web. Acá encontré mi primer tropiezo, como así que front end? Backend? Fullstack?, son términos que nunca había escuchado por allá en el 2006 cuando estudiaba ingeniería, claro eran otras épocas donde no sabíamos el impacto que iban a tener los smartphones (porque no habían), donde solo existía HTML (no el 5), css ( no el 3), javaScript (aunque era más popular el actionScript de adobe por esto del flash) y claro, el siempre complejo PHP donde unos pocos valientes se aventuraban en ese mundo. Entonces me tocó investigar un poco:</p><p><strong>Front End: </strong>La parte que interactúa con el usuario, todo aquello el usuario ve, si no vamos a un ejemplo específico, cuando ingresamos a Instagram, todo el front end son las fotos, los comentarios, los perfiles, todo aquello que podemos ver y con lo que podemos interactuar. Esto respaldado por una fuerte experiencia de usuario y un correcto diseño de interfaz (UI/UX).</p><p><strong>Back End</strong>: Es todo aquello que el usuario no ve, lo que está atrás, en los servidores. Si seguimos con el ejemplo de Instagram, como hacemos que cuando el usuario suba una foto se vaya directo al feed, y al feed de otros usuarios o cómo hacemos que cuando hagamos un comentario se pueda visualizar.</p><p><strong>Full Stack: </strong>Al parecer esta es más compleja debido a la falta de consenso que hay con el uso del término. Para las empresas un full stack es un todero, que hasta sirva tintos. Para la comunidad profesional un full stack es aquel que maneja un stack de desarrollo, ¿Y que es un stack de desarrollo?, pues un conjunto de tecnología para hacer aplicaciones. ¿Qué tipo de stacks hay? , al parecer hay varios, LAMP (Linux, Apache, MySQL, PHP), MERN(Mongo, Express, React, Node), JOLT(Java, Oracle, Tomcat, Linux) y bueno entre otros.</p><p>Para mi la dirección es clara, tengo que aprovechar todo lo que tengo recorrido y empalmar con el front end, sin descuidar el resto obviamente, siempre va a ser un plus saber de otras cosas, y en lo personal creo que no hay que limitarse a una corriente, se puede dar el caso que tenga facilidades para el backend y no lo sepa. Así que empecemos a estudiar tecnologías para desarrollo front end!!, o sea HTML, CSS y JS cierto? Y ya estamos? …. Luego nos leemos.</p>","slug":"por-donde-empezar","createdAt":"2021-03-22T16:35:26.000+00:00","id":"6058c74e522d8d001c730d3f","desc":"Siendo un “UI/UX designer”( la verdad es que no he diseñado nunca una interfaz digital o una experiencia de usuario a nivel profesional, solo a nivel de proyectos personales), me pareció más correcto irme la rama del Frontend en desarrollo we","tag":"Por Donde Empezar","image":null},{"title":"Retomando caminos","html":"<p>¿Qué lleva a una persona de 37 años con una larga trayectoria como diseñador a darle un giro tan drástico a su carrera profesional? Es una pregunta con muchas respuestas fáciles de responder, aunque pocas personas parecen comprender, después de todo una persona con casi 10 años de experiencia y hasta con maestría debería seguir por ese camino y “progresar en la vida”. Pues a veces las cosas no son tan perfectas como uno pensaría y quiero resumir un poco ciertos aspectos que me llevaron a tomar esta decisión.</p><p><strong>No es un arranque</strong></p><p>Yo empecé mi vida académica como ingeniero, de hecho, en esas proyecciones que se hace en los colegios y que hacen los padres según las notas de las materias y los gustos yo debía ser ingeniero. Entendido en matemáticas, muy arriba del promedio, con gusto por las ciencias, sobre todo las ciencias de la computación, fluido en informática desde muy pequeño y si… más que el promedio. Así pase 6 años de mi vida post colegio, estudiando ingenierías y rebotando de una universidad a otra, con notas mediocres, buscando un camino que por una tragedia familiar había perdido.</p><p><strong>El diseño como camino</strong></p><p>Tarde, pero encontré ese camino como diseñador. Estudiar diseño industrial es una de las cosas más importantes en mi vida, me dio el empuje suficiente para seguir adelante, algo por lo que interesarme, algo que me dio disciplina académica. No es fácil pasar de 6 años de algo tan cuadriculado como la ingeniería a algo tan libertino como lo es una carrera creativa tenía conflictos con la creatividad, los ingenieros son cerrados (no todos), por eso empecé a tomar clases particulares de dibujo, a leer de diseño como si estuviera haciendo un doctorado, y a meterme poco a poco en el cuento. Diseño industrial es una carrera maravillosa, entender el porqué de los productos, entender el porque de que una silla tenga esas medidas, entender porqué el mango de un cuchillo de chef tiene que ser de esa manera y no de otra es algo más que interesante, es algo que apasiona. Sin embargo, y para pesar de muchos diseñadores en Colombia no hay perspectiva de diseño, en Manizales mucho menos. Para la mayoría de gente y empresarios diseñador es un título que aplica para todo, para hacer cartelitos, tarjeticas, posters y de ahí para arriba todo lo que sea creativo o “bonito”.</p><p><strong>¿El postgrado es una solución?</strong></p><p>Yo no me arrepiento de haber hecho un postgrado en Desarrollo Sostenible y Medio Ambiente, es un tema que me encanta, que me interesa y sigo creyendo que es importante, y sigo creyendo que el mundo necesita más diseñadores que crean lo mismo que yo, ya que como diseñadores somos responsables de todos los productos que pululan en el planeta. Sin embargo en Colombia no hay un real interés por estas cosas, las empresas que se acercan a la sostenibilidad lo hacen por un tema fiscal, más no porque sea lo correcto con la sociedad y el planeta. De todas maneras esto es algo que me mueve y pronto me embarcaré en otro viaje relacionado.</p><p>Me doy cuenta que le cargo toda la culpa al contexto del país a que las oportunidades como diseñador sean pocas, también hay que aceptar que yo no he tenido el empuje suficiente para buscar mi camino independiente y abrirme mis propios espacios. Sin embargo, este sitio que estoy creando es el comienzo de un cambio de mentalidad.</p><p><strong>Y llegó la pandemia</strong></p><p>Como a mucha gente en la vida la pandemia fue un cambio en todo el sentido de la palabra, a mi personalmente me reconecto con ese camino que perdí por allá en el 2008, yo no soy mal diseñador, pero siendo honesto conmigo mismo, como desarrollador puedo brillar. Así que empecé a estudiar Ingeniería de Software y a capacitarme en línea en varias tecnologías, dispuesto a empezar de cero y a comerme el orgullo de “10 años de experiencias” o “es que yo tengo una maestría”. Afortunadamente hoy en día hay muchas áreas en donde convergen el diseño y el desarrollo, lo que se llama el UI/UX, que es un campo relativamente nuevo.</p><p>Este blog hace parte de un ejercicio personal para compartir cosas, compartir mi experiencia y mostrarle a la gente que nunca se es muy viejo para aprender cosas nuevas.</p>","slug":"retomando-caminos","createdAt":"2021-03-21T16:23:32.000+00:00","id":"6057730404b6f4001c9a9477","desc":"Empezamos una nueva ruta profesional, lo mejor que puedo hacer para empezar es una introspección para poder mirar mejor hacia adelante","tag":"Retomando Caminos","image":"https://guillermocv.herokuapp.com/content/images/2021/03/14660--Converted-.jpg"}]