[{"title":"Escogiendo un STACK","html":"<p></p><p>Una de las cosas más duras con las que me he tenido que enfrentar en el mundo del desarrollo web (y desarrollo en general) es esta, escoger un stack. Como ya había mencionado en un post anterior, hay stack de tecnologías que se complementan muy bien entre ellas para hacer aplicaciones web y que tienen sus pros y sus contras dependiendo de los sectores de la industria en la cual se trabajen. Debido a esto me puse a hacer cursos los que más pude y puedo decir que he llegado a una decisión sobre como proseguir el camino.</p><p><strong>Antes de eso me gustaría hacer un comentario sobre la curva de aprendizaje, que no puedo graficar en este momento pero creo que ha tenido 3 momentos importantes:</strong></p><p><em>- El primero, las ganas de aprender. Esto me llevó a devorar conocimiento, hacer cursos más cursos, viendo con que me sentía cómodo y con que no.</em></p><p><em>- El segundo, el golpe con la realidad. Después de tanto curso pensé, bueno ya tengo certificaciones y demás cosas, se de varias tecnologías, así que ya puedo trabajar en esto… pues no, haber que no sabes es nada, sabes repetir lo que se hace en los cursos, pero cuando te enfrentas con un problema patinas y no sabes como empezar.</em></p><p><em>- El tercero, comencemos de nuevo, el que hasta el momento me ha llevado a plantearme cosas como este blog, varios proyectos personales con el fin de poner en práctica todo lo que aprendo paso a paso, e ir escalando en habilidades poco a poco</em>.</p><p><strong>Ya con todo lo anterior, decidí proseguir de la siguiente manera:</strong></p><p><em>- Aprender más de JavaScript, si bien tengo buena fluidez en el lenguaje, me falta mucha más práctica, poder hacer en “Vanilla JS” todo lo que se puede hacer en frameworks y librerías, single page aplications, progressive web aplications, todo en JavaScript puro.</em></p><p><em>- Una vez dominado JavaScript a un nivel aceptable, procederé a aprender Svelte, que es un framework (o librería) de JavaScript que permite hacer aplicaciones web reactivas. Porqué Svelte?, me pareció de todos los que vi, el más sencillo de aprender, no porque sea realmente fácil, sino porque su estructura se basa en lo que ya se, HTML, CSS y JS. No tengo que aprender JSX ni Typescript, ni virtual DOM ni tantas cosas (no quiere decir que no lo vaya a hacer).</em></p><p>- Una vez con Svelte me voy por el framework web Sapper, que es un complemento a Svelte para hacer conectividad con APIS, bases de datos y crear aplicaciones más robustas.</p><p><strong>Porqué no React o Angular?</strong></p><p><strong>React:</strong></p><p>Es una librería grande, extensa y la más popular del marcado, de hecho en 2021 es la más demandada laboralmente. Qué pasa con React? Es muy extenso!! Para un neófito en el asunto puede llegar a ser complicado. Y si, hay que aprender React, pero para ingresar a los frameworks(o librerías), prefiero Svelte, ya luego avanzo con otro.</p><p><strong>Angular:</strong></p><p>Ha perdido popularidad, y hace tiempo pasó algo que hizo que las aplicaciones de  versiones antiguas de Angular no funcionaran con las nuevas. No me gustaría que aprendiendo Angular pase lo mismo. Y si también hay que aprender Angular, pero luego.</p><p><strong>Vue:</strong></p><p>Este no me gustó, punto. Y si, hay que aprenderlo.</p><p>Por el momento en esta página iré publicando proyectos pequeños, de práctica, nada pretencioso. Igualmente iré compartiendo unos documentos que hago para tener una referencia rápida de qué y cómo usar las tecnologías que voy aprendiendo.</p>","slug":"untitled-2","createdAt":"2021-03-31T14:54:41.000+00:00","id":"60648d31f18b5b001ca2eb54","desc":"Escoger un STACK de tecnologías es un paso importante que todo desarrollador debe tener en cuenta, no se puede saber todo.","tag":"Escogiendo un STACK","image":null},{"title":"El camino del desarrollador web","html":"<p></p><p>Resulta que en 2021 no es suficiente saber HTML, CSS y JavaScript. Claro es demasiado importante ya que es la base del desarrollo web ya que con estos tres lenguajes se construye toda la web moderna. Pero primero hablemos un poco de estos lenguajes, como propósito de esta página no es solo documentar mi aprendizaje, también darme cuenta si he aprendido o no.</p><p><strong>HTML: </strong>HTML es un lenguaje de marcado. Este concepto de marcado me generó conflictos en un principio, ya que literalmente significa Hyper Text Markup Lenguaje o lenguaje de marcado de hipertexto, lo que al principio no es muy claro ya que muchos no sabemos ni que es un hipertexto. Pero en resumen y a conclusión personal es un lenguaje de maquetación, para mi el concepto de maquetación es más claro, ya que como diseñador estoy acostumbrado a maquetear, que en diseño es un sinónimo de acomodar el contenido. ¿Cómo se maquetea con HTML? Pues sencillo, primero se tiene una idea general de como se van a ver los elementos dentro de una página web (cabecero, navegación, contenido principal, pie de página) y luego se procede a marcar con las palabras propias del lenguaje, que son extensas y no es la razón de ser de este post.</p><p><strong>CSS: </strong>CSS es otro cuento diferente, también con un nombre que nada que ver, “CASCADING STYLE SHEETS” u hojas de estilo en castada. ¿Por qué en cascada?, porque los estilos de una página web se leen de arriba hacia abajo, y si por cuenta propia o un mal accidente en la parte de abajo hay estilos que sobrescriben estilos de la parte de arriba, pues los de arriba se dejan de aplicar. Como diseñador fue mucho más fácil migrar al CSS ya que lo podía hilar con conceptos de Illustrator u otro software de diseño digital. ¿Qué es un estilo?, un estilo es “la pintura” que tienen nuestros elementos HTML, entre ellos podemos encontrar colores, tamaños, tipos de fuente, márgenes y otras más.</p><p><strong>JavaScript: </strong>JavaScript si es un lenguaje de programación como tal, robusto y con otras características que en otro post nombraré. Es lo que se usa para darle a un sitio web interacción con los usuarios. HTML y CSS es lo que se ve, JavaScript es lo que pasa. Cuando estén en Facebook viendo memes y le den like a uno de gatitos, van a ver como algo pasa, algo cambia de color o se vuelve más grande, y se ve un pulgar arriba en algún lado. Eso es JavaScript.</p><p>Entonces, desarrollo web, HTML, CSS JS y estamos listos… No!. Resulta que en 2021, como dije en un principio no es suficiente saber estos tres lenguajes, el concepto de webApp y la “nube” cambió todo. Ahora los consumidores necesitamos software complejo para hacer todo lo que hacemos por internet. El ejemplo da Facebook, es una aplicación web, conectada a servidores, que colecciona datos, que pone publicidad segmentada por usuario. Amazon, módulos de productos, módulos de pedidos, módulos de pago, sistema de reviews y bueno, así me puedo ir de largo pero el punto es que, si bien se puede hacer todo esto con los tres lenguajes principales, sería extremadamente complejo y extenso, difícil de mantener. Por esto mismo la comunidad creció y empezaron a salir frameworks y librerías. Primero sale el tan amado jQuery, que se encargó de simplificar el Java Script que en un tiempo era muy complejo, de escribirlo y de interpretarlo por los navegadores. Está también Bootstrap que con sus componentes prediseñados, ya con interacción, permitía a los desarrolladores enfocarse menos en escribir código y más a personalizarlo. Se me viene a la mente una frase de Bruno Munari consignada en uno de sus libros, que decía más o menos que el motor de cambio del ser humano es la pereza, hacer menos y obtener más.</p><p>Luego las cosas empezaron a ponerse más complejas en el desarrollo web, salen los preprocesadores de HTML y CSS, que son como una especie de marco de trabajo, para gestionar bloques de componentes en diferentes archivos, un componente por archivo, lo que hace que la lectura de código sea más sencilla y fácil de mantener. Y luego muchísimo más complejas con los frameworks y librerías de JavaScript de los cuales hablaremos un poco en el siguiente post, pero quiero dejar una reflexión para finalizar. Si bien es extenso el camino, más de lo que creía, hay que empezar con humildad por el principio y sin atajos, dominar uno a uno cada lenguaje, y no dominar en el sentido de sabérselo todo de memoria, sino en el sentido de saber como aplicarlo. Hoy en día en internet hay referencias para buscar en caso de que uno se vare, pero hay que saber qué buscar.</p>","slug":"untitled","createdAt":"2021-03-25T20:08:59.000+00:00","id":"605ceddb50800e001c3c616d","desc":"Si bien es importante saber HTML, CSS y JavaScript, hoy en día no es suficiente ya que la web moderna tiene muchas tecnologías.","tag":"El camino del Desarollador Web","image":null},{"title":"Por donde empezar?","html":"<figure class=\"kg-card kg-image-card\"><img src=\"https://guillermocv.herokuapp.com/content/images/2021/03/Asset-5-1.png\" class=\"kg-image\" alt=\"Imagen Desarrollo Front End\"></figure><p>Bueno, uno podría decir .. porqué no me hice esa pregunta hace un año cuando empecé a estudiar, o … porqué no le pregunté a alguien que me guiara. Y si, podría pensar uno que me hubiera podido ahorrar mucho tiempo, pero la verdad es que es un camino necesario que hay que recorrer.</p><p>Siendo un “UI/UX designer”( la verdad es que no he diseñado nunca una interfaz digital o una experiencia de usuario a nivel profesional, solo a nivel de proyectos personales), me pareció más correcto irme la rama del Frontend en desarrollo web. Acá encontré mi primer tropiezo, como así que front end? Backend? Fullstack?, son términos que nunca había escuchado por allá en el 2006 cuando estudiaba ingeniería, claro eran otras épocas donde no sabíamos el impacto que iban a tener los smartphones (porque no habían), donde solo existía HTML (no el 5), css ( no el 3), javaScript (aunque era más popular el actionScript de adobe por esto del flash) y claro, el siempre complejo PHP donde unos pocos valientes se aventuraban en ese mundo. Entonces me tocó investigar un poco:</p><p><strong>Front End: </strong>La parte que interactúa con el usuario, todo aquello el usuario ve, si no vamos a un ejemplo específico, cuando ingresamos a Instagram, todo el front end son las fotos, los comentarios, los perfiles, todo aquello que podemos ver y con lo que podemos interactuar. Esto respaldado por una fuerte experiencia de usuario y un correcto diseño de interfaz (UI/UX).</p><p><strong>Back End</strong>: Es todo aquello que el usuario no ve, lo que está atrás, en los servidores. Si seguimos con el ejemplo de Instagram, como hacemos que cuando el usuario suba una foto se vaya directo al feed, y al feed de otros usuarios o cómo hacemos que cuando hagamos un comentario se pueda visualizar.</p><p><strong>Full Stack: </strong>Al parecer esta es más compleja debido a la falta de consenso que hay con el uso del término. Para las empresas un full stack es un todero, que hasta sirva tintos. Para la comunidad profesional un full stack es aquel que maneja un stack de desarrollo, ¿Y que es un stack de desarrollo?, pues un conjunto de tecnología para hacer aplicaciones. ¿Qué tipo de stacks hay? , al parecer hay varios, LAMP (Linux, Apache, MySQL, PHP), MERN(Mongo, Express, React, Node), JOLT(Java, Oracle, Tomcat, Linux) y bueno entre otros.</p><p>Para mi la dirección es clara, tengo que aprovechar todo lo que tengo recorrido y empalmar con el front end, sin descuidar el resto obviamente, siempre va a ser un plus saber de otras cosas, y en lo personal creo que no hay que limitarse a una corriente, se puede dar el caso que tenga facilidades para el backend y no lo sepa. Así que empecemos a estudiar tecnologías para desarrollo front end!!, o sea HTML, CSS y JS cierto? Y ya estamos? …. Luego nos leemos.</p>","slug":"por-donde-empezar","createdAt":"2021-03-22T16:35:26.000+00:00","id":"6058c74e522d8d001c730d3f","desc":"Siendo un “UI/UX designer”( la verdad es que no he diseñado nunca una interfaz digital o una experiencia de usuario a nivel profesional, solo a nivel de proyectos personales), me pareció más correcto irme la rama del Frontend en desarrollo we","tag":"Por Donde Empezar","image":null},{"title":"Retomando caminos","html":"<p>¿Qué lleva a una persona de 37 años con una larga trayectoria como diseñador a darle un giro tan drástico a su carrera profesional? Es una pregunta con muchas respuestas fáciles de responder, aunque pocas personas parecen comprender, después de todo una persona con casi 10 años de experiencia y hasta con maestría debería seguir por ese camino y “progresar en la vida”. Pues a veces las cosas no son tan perfectas como uno pensaría y quiero resumir un poco ciertos aspectos que me llevaron a tomar esta decisión.</p><p><strong>No es un arranque</strong></p><p>Yo empecé mi vida académica como ingeniero, de hecho, en esas proyecciones que se hace en los colegios y que hacen los padres según las notas de las materias y los gustos yo debía ser ingeniero. Entendido en matemáticas, muy arriba del promedio, con gusto por las ciencias, sobre todo las ciencias de la computación, fluido en informática desde muy pequeño y si… más que el promedio. Así pase 6 años de mi vida post colegio, estudiando ingenierías y rebotando de una universidad a otra, con notas mediocres, buscando un camino que por una tragedia familiar había perdido.</p><p><strong>El diseño como camino</strong></p><p>Tarde, pero encontré ese camino como diseñador. Estudiar diseño industrial es una de las cosas más importantes en mi vida, me dio el empuje suficiente para seguir adelante, algo por lo que interesarme, algo que me dio disciplina académica. No es fácil pasar de 6 años de algo tan cuadriculado como la ingeniería a algo tan libertino como lo es una carrera creativa tenía conflictos con la creatividad, los ingenieros son cerrados (no todos), por eso empecé a tomar clases particulares de dibujo, a leer de diseño como si estuviera haciendo un doctorado, y a meterme poco a poco en el cuento. Diseño industrial es una carrera maravillosa, entender el porqué de los productos, entender el porque de que una silla tenga esas medidas, entender porqué el mango de un cuchillo de chef tiene que ser de esa manera y no de otra es algo más que interesante, es algo que apasiona. Sin embargo, y para pesar de muchos diseñadores en Colombia no hay perspectiva de diseño, en Manizales mucho menos. Para la mayoría de gente y empresarios diseñador es un título que aplica para todo, para hacer cartelitos, tarjeticas, posters y de ahí para arriba todo lo que sea creativo o “bonito”.</p><p><strong>¿El postgrado es una solución?</strong></p><p>Yo no me arrepiento de haber hecho un postgrado en Desarrollo Sostenible y Medio Ambiente, es un tema que me encanta, que me interesa y sigo creyendo que es importante, y sigo creyendo que el mundo necesita más diseñadores que crean lo mismo que yo, ya que como diseñadores somos responsables de todos los productos que pululan en el planeta. Sin embargo en Colombia no hay un real interés por estas cosas, las empresas que se acercan a la sostenibilidad lo hacen por un tema fiscal, más no porque sea lo correcto con la sociedad y el planeta. De todas maneras esto es algo que me mueve y pronto me embarcaré en otro viaje relacionado.</p><p>Me doy cuenta que le cargo toda la culpa al contexto del país a que las oportunidades como diseñador sean pocas, también hay que aceptar que yo no he tenido el empuje suficiente para buscar mi camino independiente y abrirme mis propios espacios. Sin embargo, este sitio que estoy creando es el comienzo de un cambio de mentalidad.</p><p><strong>Y llegó la pandemia</strong></p><p>Como a mucha gente en la vida la pandemia fue un cambio en todo el sentido de la palabra, a mi personalmente me reconecto con ese camino que perdí por allá en el 2008, yo no soy mal diseñador, pero siendo honesto conmigo mismo, como desarrollador puedo brillar. Así que empecé a estudiar Ingeniería de Software y a capacitarme en línea en varias tecnologías, dispuesto a empezar de cero y a comerme el orgullo de “10 años de experiencias” o “es que yo tengo una maestría”. Afortunadamente hoy en día hay muchas áreas en donde convergen el diseño y el desarrollo, lo que se llama el UI/UX, que es un campo relativamente nuevo.</p><p>Este blog hace parte de un ejercicio personal para compartir cosas, compartir mi experiencia y mostrarle a la gente que nunca se es muy viejo para aprender cosas nuevas.</p>","slug":"retomando-caminos","createdAt":"2021-03-21T16:23:32.000+00:00","id":"6057730404b6f4001c9a9477","desc":"Empezamos una nueva ruta profesional, lo mejor que puedo hacer para empezar es una introspección para poder mirar mejor hacia adelante","tag":"Retomando Caminos","image":"https://guillermocv.herokuapp.com/content/images/2021/03/14660--Converted-.jpg"}]